{"keras_version": "2.0.5", "backend": "tensorflow", "class_name": "Sequential", "config": [{"class_name": "LSTM", "config": {"name": "lstm_1", "bias_constraint": null, "activity_regularizer": null, "return_sequences": false, "kernel_regularizer": null, "recurrent_constraint": null, "batch_input_shape": [null, 1, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "go_backwards": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 4, "implementation": 0, "stateful": false, "dropout": 0.0, "unroll": false, "use_bias": true, "dtype": "float32", "kernel_constraint": null, "recurrent_dropout": 0.0, "return_state": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "recurrent_regularizer": null, "activation": "tanh", "unit_forget_bias": true, "trainable": true, "bias_regularizer": null, "recurrent_activation": "hard_sigmoid"}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "name": "dense_1", "units": 1, "activity_regularizer": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "activation": "linear", "trainable": true, "bias_regularizer": null, "use_bias": true}}]}